NordicPlayground/nRF-Beehavior-Firmware/nrf53_52_woodpecker_detector/edge-impulse/ingestion-sdk-c/ei_run_impulse.cpp
/*
#define EI_LED_ALL      BOARD_ledSetLedOn(1, 1, 1, 1)
#define EI_LED_BLUE     BOARD_ledSetLedOn(1, 0, 0, 0)
#define EI_LED_GREEN    BOARD_ledSetLedOn(0, 1, 0, 0)
#define EI_LED_YELLOW   BOARD_ledSetLedOn(0, 0, 1, 0)
#define EI_LED_RED      BOARD_ledSetLedOn(0, 0, 0, 1)
#define EI_LED_OFF      BOARD_ledSetLedOn(0, 0, 0, 0)
*/

/*
// Resets classification table values. **BY ME**
if(ei_user_invoke_reset() || ei_ble_user_invoke_reset()) {
    for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
        classification_label_count[ix] = 0;
        classification_label_count_streak[ix] = 0;
    }
}
// *****
*/

void run_nn(bool debug)
{      
    char ble_printf[8] = {0};  // Can be lowered to send fewer bytes.
    extern signal_t ei_microphone_get_signal();

    // summary of inferencing settings (from model_metadata.h)
    ei_printf("Inferencing settings:\n");
    ei_printf("\tInterval: ");
    ei_printf_float((float)EI_CLASSIFIER_INTERVAL_MS);
    ei_printf("ms.\n");
    ei_printf("\tFrame size: %d\n", EI_CLASSIFIER_DSP_INPUT_FRAME_SIZE);
    ei_printf("\tSample length: %d ms.\n", EI_CLASSIFIER_RAW_SAMPLE_COUNT / 16);
    ei_printf("\tNo. of classes: %d\n", sizeof(ei_classifier_inferencing_categories) /
                                            sizeof(ei_classifier_inferencing_categories[0]));

    if (ei_microphone_inference_start(EI_CLASSIFIER_RAW_SAMPLE_COUNT) == false) {
        ei_printf("ERR: Failed to setup audio sampling\r\n");
        return;
    }

    ei_printf("Starting inferencing. Press 'b' to break.\n");


    // Fill upper row of classification label array with class labels. **BY ME**
    for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
       classification_label_name [ix] = ei_classifier_inferencing_categories[ix];
    }

    classification_label_name [EI_CLASSIFIER_LABEL_COUNT] = "undefined"; // Adds undefined label for when min conf rating isn't reached.

    while (1) {
        ei_printf("Starting inferencing in 2 seconds...\n");

        BOARD_ledSetLedOn(0, 0, 0, 0); // resets LEDs from last classification **BY ME**

        // instead of wait_ms, we'll wait on the signal, this allows threads to cancel us...
        if (ei_sleep(2000) != EI_IMPULSE_OK) {
            break;
        }

        if(ei_user_invoke_stop() || ei_ble_user_invoke_stop()) {
            ei_printf("Inferencing stopped by user\r\n");
            break;
        }

        ei_printf("Recording...\n");

        ei_microphone_inference_reset_buffers();
        bool m = ei_microphone_inference_record();
        if (!m) {
            ei_printf("ERR: Failed to record audio...\n");
            break;
        }

        ei_printf("Recording done\n");

        signal_t signal;
        signal.total_length = EI_CLASSIFIER_RAW_SAMPLE_COUNT;
        signal.get_data = &ei_microphone_audio_signal_get_data;
        ei_impulse_result_t result = {0};

        EI_IMPULSE_ERROR r = run_classifier(&signal, &result, debug);
        if (r != EI_IMPULSE_OK) {
            ei_printf("ERR: Failed to run classifier (%d)\n", r);
            break;
        }

        // print the predictions
        ei_printf("Predictions (DSP: %d ms., Classification: %d ms., Anomaly: %d ms.): \n",
            result.timing.dsp, result.timing.classification, result.timing.anomaly);
        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
            ei_printf("    %s: \t", result.classification[ix].label);
            ei_printf_float(result.classification[ix].value);
            ei_printf("\r\n");
            // ** BLE printf ** add this if you want 
            //sprintf(ble_printf, "%s: %f\n", result.classification[ix].label, result.classification[ix].value);
            //ble_nus_send_data(ble_printf, strlen(ble_printf));
            // ** End BLE printf **
            
            // Adding classifications to array **BY ME**
            if ((result.classification[ix].value)*100 >= min_conf_rating) {
                classification_label_count [ix] += 1;
                classification_label_count_streak [ix] += 1;
                label_found = true; // confirms that a class is found.
                // result_ble += ix; // code to be sent over BLE is updated to correct value.
            }
            
            // Resetting streak of classifications **BY ME**
            else {
                classification_label_count_streak [ix] = 0;
            }

        }

        // Adds observation to undefined class (last index), if the min conf rating isn't reached by any of the defined classes. **BY ME**
        if (!label_found) {
            classification_label_count[EI_CLASSIFIER_LABEL_COUNT] += 1;
        }

        // Code for printing table **BY ME**
        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT+1; ix++) {
            ei_printf("%s \t", classification_label_name[ix]);    
            }   
        ei_printf("\r\n");
           
        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT+1; ix++) {
            ei_printf("%d \t\t", classification_label_count[ix]);
        }
        ei_printf("\r\n");

        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT+1; ix++) {
            ei_printf("%d \t\t", classification_label_count_streak[ix]);
        }
        
        // Code for deciding when to give alert and/or streak alert **BY ME**
        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
            if (classification_label_count[ix] > num_total_alert && ix == index_alert) {
            label_alert = true;
            ei_printf("\n %s ALERT!!!", classification_label_name[ix]);
            sprintf(ble_printf, "\n %s ALERT!!!", classification_label_name[ix]);
            ble_nus_send_data(ble_printf, strlen(ble_printf));
            }
            if (classification_label_count_streak[ix] > num_streak_alert && ix == index_alert) {
            label_streak_alert = true;
            ei_printf("\n %s STREAK ALERT!!!", classification_label_name[ix]);
            sprintf(ble_printf, "\n %s STREAK ALERT!!!", classification_label_name[ix]);
            ble_nus_send_data(ble_printf, strlen(ble_printf));
            }
        }
        ei_printf("\r\n");

