NordicPlayground/nRF-Beehavior-Firmware/nrf53_52_woodpecker_detector/edge-impulse/ingestion-sdk-c/ei_run_impulse.cpp
        /*
        // Activates LEDs if alert and/or streak alert is triggered (not really necessary).
        if (label_alert && label_streak_alert) { // Blinks LED 1 & 4 if both alerts are triggered.
            BOARD_ledSetLedOn(1, 0, 0, 1);
            k_msleep(500);    
        }

        else if (label_alert) { // Blinks only LED 1 if only regular alert is triggered.
            BOARD_ledSetLedOn(1, 0, 0, 0);
            k_msleep(500);    
        }

        else if (label_streak_alert) { // Blinks only LED 4 if only streak alert is triggered.
            BOARD_ledSetLedOn(0, 0, 0, 1);
            k_msleep(500);    
        }
        */

        label_alert = false; // resets flag
        label_streak_alert = false; // resets flag
        label_found = false; // resets flag

#if EI_CLASSIFIER_HAS_ANOMALY == 1
        ei_printf("    anomaly score: ");
        ei_printf_float(result.anomaly);
        ei_printf("\r\n");
#endif


    // Add the following if you want classification results to be printed over nus as well.
    /*BLE PRINTF
        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {            
            sprintf(ble_printf, "%s: %f\n", result.classification[ix].label, result.classification[ix].value);
            ble_nus_send_data(ble_printf, strlen(ble_printf));
        }
#if EI_CLASSIFIER_HAS_ANOMALY == 1
        sprintf(ble_printf, "anomaly score: %f\n", result.anomaly);
        ble_nus_send_data(ble_printf, strlen(ble_printf));
#endif

        memset(ble_printf, 0x00, sizeof(ble_printf));
    END BLE PRINTF*/
        
        if(ei_user_invoke_stop() || ei_ble_user_invoke_stop()) {
            ei_printf("Inferencing stopped by user\r\n");
            ble_nus_send_data("Inferencing stopped by user\n", strlen("Inferencing stopped by user\n"));
            memset(ble_printf, 0x00, sizeof(ble_printf));
            break;
        }

        
        // Resets classification table values by entering 'r'. **BY ME**
        else if(ei_user_invoke_reset() || ei_ble_user_invoke_reset()) {
            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT+1; ix++) {
                classification_label_count[ix] = 0;
                classification_label_count_streak[ix] = 0;
            }
        }
        // *****
    }

    ei_microphone_inference_end();
}

void run_nn_continuous(bool debug)
{
    char ble_printf[8] = {0}; // Can be lowered to send fewer bytes.
    bool stop_inferencing = false;
    int print_results = -(EI_CLASSIFIER_SLICES_PER_MODEL_WINDOW);
    // summary of inferencing settings (from model_metadata.h)
    ei_printf("Inferencing settings:\n");
    ei_printf("\tInterval: ");
    ei_printf_float((float)EI_CLASSIFIER_INTERVAL_MS);
    ei_printf("ms.\n");
    ei_printf("\tFrame size: %d\n", EI_CLASSIFIER_DSP_INPUT_FRAME_SIZE);
    ei_printf("\tSample length: %d ms.\n", EI_CLASSIFIER_RAW_SAMPLE_COUNT / 16);
    ei_printf("\tNo. of classes: %d\n", sizeof(ei_classifier_inferencing_categories) /
                                            sizeof(ei_classifier_inferencing_categories[0]));

    ei_printf("Starting inferencing. Press 'b' to break.\n");

    run_classifier_init();
    ei_microphone_inference_start(EI_CLASSIFIER_SLICE_SIZE);

    // Fill upper row of classification label array with class labels. **BY ME**
    for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
       classification_label_name [ix] = ei_classifier_inferencing_categories[ix];
    }

    while (stop_inferencing == false) {

        bool m = ei_microphone_inference_record();
        if (!m) {
            ei_printf("ERR: Failed to record audio...\n");
            break;
        }

        signal_t signal;
        signal.total_length = EI_CLASSIFIER_SLICE_SIZE;
        signal.get_data = &ei_microphone_audio_signal_get_data;
        ei_impulse_result_t result = {0};

        EI_IMPULSE_ERROR r = run_classifier_continuous(&signal, &result, debug);
        if (r != EI_IMPULSE_OK) {
            ei_printf("ERR: Failed to run classifier (%d)\n", r);
            break;
        }

        if (++print_results >= (EI_CLASSIFIER_SLICES_PER_MODEL_WINDOW >> 1)) {
            // print the predictions
            ei_printf("Predictions (DSP: %d ms., Classification: %d ms., Anomaly: %d ms.): \n",
                result.timing.dsp, result.timing.classification, result.timing.anomaly);
            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
                ei_printf("    %s: \t", result.classification[ix].label);
                ei_printf_float(result.classification[ix].value);
                ei_printf("\r\n");

                // Adding classifications to array **BY ME**
                if ((result.classification[ix].value)*100 >= min_conf_rating) {
                    classification_label_count [ix] += 1;
                    classification_label_count_streak [ix] += 1;
                    label_found = true; // confirms that a class is found.
                }
            
                // Resetting streak of classifications if the actual class isn't classified this time. **BY ME**
                else {
                    classification_label_count_streak [ix] = 0;
                }
            }

            // Adds observation to uncertain class, if the min conf rating isn't fulfilled by any of the defined classes. **BY ME**
            if (!label_found) {
                classification_label_count[EI_CLASSIFIER_LABEL_COUNT] += 1;
            }

            // Code for printing table **BY ME**
            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
                ei_printf("%s \t", classification_label_name[ix]);    
            }   
            ei_printf("\r\n");
           
            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
                ei_printf("%d \t\t", classification_label_count[ix]);
            }
            ei_printf("\t Total");
            ei_printf("\r\n");

            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
                ei_printf("%d \t\t", classification_label_count_streak[ix]);
            }
            ei_printf("\t Streak");
            // *****
        
