NordicPlayground/nRF-Beehavior-Firmware/nrf53_52_woodpecker_detector/edge-impulse/ingestion-sdk-c/ei_run_impulse.cpp
            // Code for deciding when to give alert **BY ME**
            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {
                if (classification_label_count[ix] > num_total_alert) {
                    //label_alert = true;
                    ei_printf("\n %s ALERT!!!", classification_label_name[ix]);
                }
                if (classification_label_count_streak[ix] > num_streak_alert) {
                    //label_alert = true;
                    ei_printf("\n %s STREAK ALERT!!!", classification_label_name[ix]);
                }
            }
            ei_printf("\r\n");

            label_found = false; // resets flag
            // *****

#if EI_CLASSIFIER_HAS_ANOMALY == 1
            ei_printf("    anomaly score: ");
            ei_printf_float(result.anomaly);
            ei_printf("\r\n");
#endif

            print_results = 0;
        }

    // Add the following if you want classification results to be printed over nus as well.
    /*BLE PRINTF
        for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT; ix++) {            
            sprintf(ble_printf, "%s: %f\n", result.classification[ix].label, result.classification[ix].value);
            ble_nus_send_data(ble_printf, strlen(ble_printf));
        }
#if EI_CLASSIFIER_HAS_ANOMALY == 1
        sprintf(ble_printf, "anomaly score: %f\n", result.anomaly);
        ble_nus_send_data(ble_printf, strlen(ble_printf));
#endif

        memset(ble_printf, 0x00, sizeof(ble_printf));
    END BLE PRINTF*/

        if(ei_user_invoke_stop() || ei_ble_user_invoke_stop()) {
            ei_printf("Inferencing stopped by user\r\n");
            ble_nus_send_data("Inferencing stopped by user\n", strlen("Inferencing stopped by user\n"));
            memset(ble_printf, 0x00, sizeof(ble_printf));
            break;
        }

        // Resets classification table values by entering 'r'. **BY ME**
        else if(ei_user_invoke_reset() || ei_ble_user_invoke_reset()) {
            ei_printf("Table reset\r\n");
            for (size_t ix = 0; ix < EI_CLASSIFIER_LABEL_COUNT+1; ix++) {
                classification_label_count[ix] = 0;
                classification_label_count_streak[ix] = 0;
            }
        }
        // *****
    }

    ei_microphone_inference_end();
}

#else

#error "EI_CLASSIFIER_SENSOR not configured, cannot configure `run_nn`"

#endif  // EI_CLASSIFIER_SENSOR

void run_nn_continuous_normal()
{
#if defined(EI_CLASSIFIER_SENSOR) && EI_CLASSIFIER_SENSOR == EI_CLASSIFIER_SENSOR_MICROPHONE
    run_nn_continuous(false);
#else
    ei_printf("Error no continuous classification available for current model\r\n");
#endif
}

void run_nn_normal(void)
{
    run_nn(false);
}

//added BY NORA /////////////////////////////////////////////////////////////////////7


/* Prevent deep sleep (system off) from being entered on long timeouts
 * or `K_FOREVER` due to the default residency policy.
 *
 * This has to be done before anything tries to sleep, which means
 * before the threading system starts up between PRE_KERNEL_2 and
 * POST_KERNEL.  Do it at the start of PRE_KERNEL_2.
 */

//gpio_pin_configure(dev, LED0, GPIO_OUTPUT);

static int disable_ds_1(const struct device *dev)
{
	ARG_UNUSED(dev);

	pm_ctrl_disable_state(POWER_STATE_DEEP_SLEEP_1);
	return 0;
}

SYS_INIT(disable_ds_1, PRE_KERNEL_2, 0);

void MakingSysSleepNight (int clock_signal){
    int rc;
    const struct device *cons = device_get_binding(CONSOLE_LABEL);
    const struct device * devi = device_get_binding("GPIO_0"); //der lager vi dev som  skal brukes 
    if (clock_signal>1900 || clock_signal<0600){
        

	    printk("\n%s system off demo\n", CONFIG_BOARD,"\n%s er i funksjonen\n");

	    /* Configure to generate PORT event (wakeup) on button 1 press. */
        /* nrf_gpio_cfg_input(DT_GPIO_PIN(PIN1, gpios), //må finne ut hvordan man setter pins for vi vil ikke ha knapp
			    NRF_GPIO_PIN_PULLUP);
	    nrf_gpio_cfg_sense_set(DT_GPIO_PIN(PIN1, gpios),
			       NRF_GPIO_PIN_SENSE_LOW);*/

        gpio_pin_configure(devi,NRF_GPIO_PIN_S0S1, GPIO_INT_LEVEL_HIGH );// her tror jeg at den sier at det resettes når pin 1 mottar strøm 
        gpio_pin_set(devi,NRF_GPIO_PIN_S0S1,0); // får ikke feilmelding, men det funker ikke mehehe

	    /*printk("Busy-wait %u s\n", BUSY_WAIT_S);
	    k_busy_wait(BUSY_WAIT_S * USEC_PER_SEC);
        
	    printk("Busy-wait %u s with UART off\n", BUSY_WAIT_S);
	    rc = device_set_power_state(cons, DEVICE_PM_LOW_POWER_STATE, NULL, NULL);
	    k_busy_wait(BUSY_WAIT_S * USEC_PER_SEC);
	    rc = device_set_power_state(cons, DEVICE_PM_ACTIVE_STATE, NULL, NULL);

	    printk("Sleep %u s\n", SLEEP_S);
	    k_sleep(K_SECONDS(SLEEP_S));

	    printk("Sleep %u s with UART off\n", SLEEP_S);
        */
	    rc = device_set_power_state(devi, DEVICE_PM_LOW_POWER_STATE, NULL, NULL);
	    /*k_sleep(K_MSEC(2));//lagt inn to sekunder her, så får vi se
	    rc = device_set_power_state(cons, DEVICE_PM_ACTIVE_STATE, NULL, NULL);*/
        
    

	    printk("Entering system off; press BUTTON1 to restart\n");

	    /* Above we disabled entry to deep sleep based on duration of
	     * controlled delay.  Here we need to override that, then
	     * force entry to deep sleep on any delay.
	     */
	    pm_power_state_force(POWER_STATE_DEEP_SLEEP_1);
	    k_sleep(K_MSEC(2));

	    printk("ERROR: System off failed\n");
	    while (true) {
		    /* spin to avoid fall-off behavior */
	    }

    }
    else {
        printk("it's dayyy");
    }
 

}